cf_billing/InformationRegisters/бестРолиИЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестРолиИЗадачи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестПроверкаКомплектаДокументов</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестПодготовкаПроектаДоговора</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестНаправлениеДокументаРуководителю</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестНаправлениеПротоколаРазногласийЮристам</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестЗаключениеДоговора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестРолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестСрокиИсполненияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСрокиИсполненияЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестПроверкаКомплектаДокументов</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестПодготовкаПроектаДоговора</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестНаправлениеДокументаРуководителю</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестНаправлениеПротоколаРазногласийЮристам</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестЗаключениеДоговора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособПолученияЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСпособыПолученияЗаявки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаличиеЭкспертногоЗаключения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестРолиИИсполнители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестРолиИИсполнители</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестРолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестНастройкаОтправкиПочтыИзБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестНастройкаОтправкиПочтыИзБП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестПроверкаКомплектаДокументов</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестПодготовкаПроектаДоговора</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестНаправлениеДокументаРуководителю</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестНаправлениеПротоколаРазногласийЮристам</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестЗаключениеДоговора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестАктуальныеСтатусыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестАктуальныеСтатусыДоговоров</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСтатусыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСведенияОФайлахДополнительныеРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСведенияОФайлахДополнительныеРеквизиты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТипыПрикрепляемыхФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайл</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестОбязательныеДокументыДляЗаключенияДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестОбязательныеДокументыДляЗаключенияДоговора</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТипФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТипыПрикрепляемыхФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестКатегорииКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестНастройкаЗаполненияПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестНастройкаЗаполненияПисем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестПроверкаКомплектаДокументов</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестПодготовкаПроектаДоговора</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестНаправлениеДокументаРуководителю</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестНаправлениеПротоколаРазногласийЮристам</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестЗаключениеДоговора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/бестСпособыПолученияЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестСпособыПолученияЗаявки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноОтСетевойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаБумажномНосителе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЭлектроннойПочте</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/бестРезультатыЗадачДоговорногоБлока.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестРезультатыЗадачДоговорногоБлока</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказВЗаключенииДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьПоЭлПочтеСмс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВернутьНаДоработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученПротоколРазногласий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоставитьПротоколСогласованияРазногласий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/CommonModules/бестБизнесПроцессДоговорногоБлока/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// При создании задачи.
//
// Параметры:
//  ТочкаМаршрутаБизнесПроцесса	-	ТочкаМаршрутаБизнесПроцессаСсылка.
//  ФормируемыеЗадачи			-	ЗадачаСсылка.
//  СтандартнаяОбработка		-	Будево.
//  БП							-	БизнесПроцессСсылка.
//
&НаСервере
Процедура ПриСозданииЗадач(Знач ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка, БП) Экспорт
	Договор  				= БП.Договор;
	
	СтруктураРеквизитовЗаполнения	= Новый Структура;
	СтруктураРеквизитовЗаполнения.Вставить("Роль", 		   РегистрыСведений.бестРолиИЗадачи.ПолучитьРольПоТочкеМаршрута(ТочкаМаршрутаБизнесПроцесса));
	СтруктураРеквизитовЗаполнения.Вставить("Организация",  БП.Организация);
	СтруктураРеквизитовЗаполнения.Вставить("ОбъектЗадачи", БП.ОбъектБП);
	СтруктураРеквизитовЗаполнения.Вставить("Договор", 	   Договор);
	
	СпособПолученияЗаявки 	= ?(ТипЗнч(СтруктураРеквизитовЗаполнения.ОбъектЗадачи) = Тип("ДокументСсылка.бестЗаключениеДоговоровСЮридическимиЛицами"), СтруктураРеквизитовЗаполнения.ОбъектЗадачи.СпособПолученияЗаявки,Перечисления.бестСпособыПолученияЗаявки.НаБумажномНосителе);	
	
	КолвоДней = РегистрыСведений.бестСрокиИсполненияЗадач.ПолучитьСрокИсполнения(ТочкаМаршрутаБизнесПроцесса,СпособПолученияЗаявки,Договор.НаличиеЭкспертногоЗаключения);
	
	Если КолвоДней <> Неопределено Тогда
		СтруктураРеквизитовЗаполнения.Вставить("СрокИсполнения", 	РассчитатьСрокИсполнения(СпособПолученияЗаявки, КолвоДней));
	КонецЕсли;
	
	УстановитьЗначениеРеквизитов(ФормируемыеЗадачи, СтруктураРеквизитовЗаполнения);
КонецПроцедуры

// Проверяет доступность задачи для пользователя.
//
// Параметры:
//  Задача			-	ЗадачаСсылка.
//  Пользователь	-	СправочникСсылка.Пользователи
//
// Возвращаемое значение:
//   Булево.
//
&НаСервере
Функция ПроверитьДоступностьЗадачиДляПользователя(Задача,Пользователь) Экспорт
	Если ЗначениеЗаполнено(Задача.Исполнитель) Тогда
		Возврат Пользователь = Задача.Исполнитель;
	КонецЕсли;
	
	РольИсполнителя = РегистрыСведений.бестРолиИИсполнители.ПолучитьРольИсполнителя(Пользователь);
	Если РольИсполнителя = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат РольИсполнителя = РегистрыСведений.бестРолиИЗадачи.ПолучитьРольПоТочкеМаршрута(Задача.ТочкаМаршрута)
	КонецЕсли;	
КонецФункции

// Открывает карту маршрута бизнес-процесса.
//
// Параметры:
//  БизнесПроцесс	-	БизнесПроцессСсылка.
//
&НаКлиенте
Процедура ОткрытьКартуМаршрута(БизнесПроцесс) Экспорт
	ПараметрыОткрытия	= Новый Структура("БизнесПроцесс", БизнесПроцесс);
	ОткрытьФорму("ОбщаяФорма.бестКартаМаршрутаБП", ПараметрыОткрытия);
КонецПроцедуры

// Проверка условия в бизнес-процессе.
//
// Параметры:
//  ТочкаМаршрутаБизнесПроцесса	-	ТочкаМаршрутаБизнесПроцессаСсылка.
//  Результат					-	Строка.
//  БП							-	БизнесПроцессСсылка.
//
&НаСервере
Процедура ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат, БП) Экспорт
	ТипЗнчБП	= ТипЗнч(БП);
	
	Если ТипЗнчБП = Тип("БизнесПроцессСсылка.бестПроверкаКомплектаДокументов") Тогда
		
		Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.бестПроверкаКомплектаДокументов.ТочкиМаршрута.РешениеЗаключенииДоговора Тогда
			Если БП.ПоследнийРезультат = Перечисления.бестРезультатыЗадачДоговорногоБлока.ОтказВЗаключенииДоговора Тогда
				Результат	= БизнесПроцессы.бестПроверкаКомплектаДокументов.ТочкиМаршрута.РешениеЗаключенииДоговора.Варианты[1];
			ИначеЕсли ПроверитьОбязательныеФайлы(БП.Договор) Тогда
				Результат	= БизнесПроцессы.бестПроверкаКомплектаДокументов.ТочкиМаршрута.РешениеЗаключенииДоговора.Варианты[0];
			Иначе
				Результат	= БизнесПроцессы.бестПроверкаКомплектаДокументов.ТочкиМаршрута.РешениеЗаключенииДоговора.Варианты[2];
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипЗнчБП = Тип("БизнесПроцессСсылка.бестНаправлениеДокументаРуководителю") Тогда
		Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.бестНаправлениеДокументаРуководителю.ТочкиМаршрута.ВернутьНаДоработку Тогда
			Результат	= БП.ПоследнийРезультат = Перечисления.бестРезультатыЗадачДоговорногоБлока.ВернутьНаДоработку;
		КонецЕсли;
		
	ИначеЕсли ТипЗнчБП = Тип("БизнесПроцессСсылка.бестЗаключениеДоговора") Тогда
		Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.бестЗаключениеДоговора.ТочкиМаршрута.НаправленОтказ Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	бестЗадачаДоговорногоБлока.Ссылка КАК Ссылка
			|ИЗ
			|	Задача.бестЗадачаДоговорногоБлока КАК бестЗадачаДоговорногоБлока
			|ГДЕ
			|	бестЗадачаДоговорногоБлока.Выполнена
			|	И НЕ бестЗадачаДоговорногоБлока.ПометкаУдаления
			|	И бестЗадачаДоговорногоБлока.ТочкаМаршрута = &ТочкаМаршрута
			|	И бестЗадачаДоговорногоБлока.Договор = &Договор";
			
			Запрос.УстановитьПараметр("Договор",  		БП.Договор);
			Запрос.УстановитьПараметр("ТочкаМаршрута",  БизнесПроцессы.бестПроверкаКомплектаДокументов.ТочкиМаршрута.УведомлениеОбОтказе);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Результат	= НЕ РезультатЗапроса.Пустой();
			
		ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.бестЗаключениеДоговора.ТочкиМаршрута.ДоговорПодписанБезЗамечаний 
			ИЛИ ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.бестЗаключениеДоговора.ТочкиМаршрута.ПротоколРазногласийПодписан Тогда
			Результат	= БП.ПоследнийРезультат = Перечисления.бестРезультатыЗадачДоговорногоБлока.Выполнено;
		ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.бестЗаключениеДоговора.ТочкиМаршрута.ДоговорЗаключенДоАТП Тогда
			Результат	= ?(ЗначениеЗаполнено(БП.ОбъектБП), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БП.ОбъектБП, "ЗаключениеДоговораДоТП"),Ложь) ;
		КонецЕсли;
		
	ИначеЕсли ТипЗнчБП = Тип("БизнесПроцессСсылка.бестНаправлениеПротоколаРазногласийЮристам") Тогда
		Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.бестНаправлениеПротоколаРазногласийЮристам.ТочкиМаршрута.РазногласияНеТребуютДокументальногоПодтверждения Тогда
			Результат	= БП.ПоследнийРезультат = Перечисления.бестРезультатыЗадачДоговорногоБлока.Выполнено;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

// Обработка в бизнес-процессе.
//
// Параметры:
//  ТочкаМаршрута	-	ТочкаМаршрутаБизнесПроцессаСсылка.
//  БП				-	БизнесПроцессОбъект.
//
&НаСервере
Процедура Обработка(ТочкаМаршрута, БП) Экспорт
	
	ТипЗнчБП	= ТипЗнч(БП);
	
	Если ТипЗнчБП = Тип("БизнесПроцессОбъект.бестЗаключениеДоговора") Тогда
		
		Если ТочкаМаршрута = БизнесПроцессы.бестЗаключениеДоговора.ТочкиМаршрута.ДоговорПроект Тогда
			ИзменитьСтатусЗаявки(БП.Договор ,Перечисления.бестСтатусыДоговоров.Проект); 
		ИначеЕсли ТочкаМаршрута = БизнесПроцессы.бестЗаключениеДоговора.ТочкиМаршрута.ДоговорЗаключен Тогда
			ИзменитьСтатусЗаявки(БП.Договор ,Перечисления.бестСтатусыДоговоров.Действующий);
		ИначеЕсли ТочкаМаршрута = БизнесПроцессы.бестЗаключениеДоговора.ТочкиМаршрута.ДоговорРасчетный Тогда
			ИзменитьСтатусЗаявки(БП.Договор ,Перечисления.бестСтатусыДоговоров.Расчетный);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// При создании вложенных бизнес процессов
//
// Параметры:
//  ТочкаМаршрутаБизнесПроцесса	-	ТочкаМаршрутаБизнесПроцессаСсылка.
//  ФормируемыеБизнесПроцессы	-	Массив.
//  Отказ						-	Булево.
//  ВедущийБП					-	БизнесПроцессСсылка.
//
&НаСервере
Процедура ПриСозданииВложенныхБизнесПроцессов(ТочкаМаршрутаБизнесПроцесса, ФормируемыеБизнесПроцессы, Отказ, ВедущийБП) Экспорт
	
	Если ЗначениеЗаполнено(ВедущийБП.Организация) Тогда
		Для Каждого ОбъектБП Из ФормируемыеБизнесПроцессы Цикл
			ОбъектБП.Организация	= ВедущийБП.Организация;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВедущийБП.Договор) Тогда
		Для Каждого ОбъектБП Из ФормируемыеБизнесПроцессы Цикл
			ОбъектБП.Договор	= ВедущийБП.Договор;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВедущийБП.Район) Тогда
		Для Каждого ОбъектБП Из ФормируемыеБизнесПроцессы Цикл
			ОбъектБП.Район	= ВедущийБП.Район;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВедущийБП.ОбъектБП) Тогда
		Для Каждого ОбъектБП Из ФормируемыеБизнесПроцессы Цикл
			ОбъектБП.ОбъектБП	= ВедущийБП.ОбъектБП;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// При выполнении задачи.
//
// Параметры:
//  ТочкаМаршрута	-	ТочкаМаршрутаБизнесПроцессаСсылка.
//  Задача			-	ОбъектМетаданных: Задача.
//  Отказ			-	Булево.
//  БПОбъект		-	БизнесПроцессОбъект.
//
&НаСервере
Процедура ПриВыполненииЗадачи(ТочкаМаршрута, Задача, Отказ, БПОбъект) Экспорт
	БПОбъект.ПоследнийРезультат		= Задача.Результат;
	БПОбъект.Записать();
КонецПроцедуры

// Отправляет письмо.
//
// Параметры:
//  Задача	-	ЗадачаСсылка.бестЗадачаДоговорногоБлока.
//
&НаСервере
Процедура ОтправитьПисьмо(Задача) Экспорт
	Письма 	= Новый Массив;
	Вложения 					= Новый Массив;
	УчетнаяЗаписьОтКого 		= РегистрыСведений.бестНастройкаОтправкиПочтыИзБП.ПолучитьУчетнуюЗапись(Задача.ТочкаМаршрута);
	ОписаниеВложенияПисьма 		= "Представление,АдресВоВременномХранилище,ДвоичныеДанные";
	ОписаниеПараметровПисьма 	= "Кому,Тема,Тело,Вложения";
	Результат = ПолучитьДанныеЗаполнения(Задача);
	Выборка   = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьВложения(Вложения, ОписаниеВложенияПисьма, Задача.ОтправляемыеФайлы);
		ПараметрыПисьма 			= Новый Структура(ОписаниеПараметровПисьма, Выборка.АдресКому, Выборка.Тема, Выборка.Тело, Вложения);	
		ПодготовленноеПисьмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(УчетнаяЗаписьОтКого, ПараметрыПисьма);
		Письма.Добавить(ПодготовленноеПисьмо);
		РезультатОтправкиПисем		= РаботаСПочтовымиСообщениями.ОтправитьПисьма(УчетнаяЗаписьОтКого, Письма);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗначениеРеквизитов(ФормируемыеЗадачи, СтруктураРеквизитов)
	
	Для Каждого ЗадачаОбъект Из ФормируемыеЗадачи Цикл
		Для Каждого Реквизит Из СтруктураРеквизитов Цикл
			ЗадачаОбъект[Реквизит.Ключ]	= Реквизит.Значение;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ЗадачаОбъект.Результат) Тогда
			ЗадачаОбъект.ВыполнитьЗадачу();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РассчитатьСрокИсполнения(СпособПолученияЗаявки,КолвоДней)
	Если СпособПолученияЗаявки = Перечисления.бестСпособыПолученияЗаявки.НаБумажномНосителе Тогда
		Возврат КонецДня(ТекущаяДата() + КолвоДней * 86400);
	Иначе
		МассивДат = Новый Массив;
		МассивДат.Добавить(ТекущаяДата() + КолвоДней * 86400);
		СоответствиеРабДата = КалендарныеГрафики.БлижайшиеРабочиеДаты(КалендарныеГрафики.ОсновнойПроизводственныйКалендарь(), МассивДат);
		Для каждого эл из СоответствиеРабДата Цикл
			Возврат КонецДня(эл.Значение);
		КонецЦикла;
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции

&НаСервере
Процедура ИзменитьСтатусЗаявки(Договор ,Статус)
	Набор  	= РегистрыСведений.бестАктуальныеСтатусыДоговоров.СоздатьНаборЗаписей();
	Набор.Отбор.Договор.установить(Договор);
	Запись = Набор.Добавить();
	Запись.Договор = Договор;
	Запись.Период = ТекущаяДата();
	Запись.Статус = Статус;
	Набор.Записать(Ложь);
КонецПроцедуры

&НаСервере
Функция ПроверитьОбязательныеФайлы(Договор)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргДоговорыКонтрагентовПрисоединенныеФайлы.Ссылка КАК Ссылка,
	|	энргДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	энргДоговорыКонтрагентов.КатегорияКонтрагента КАК КатегорияКонтрагента,
	|	энргДоговорыКонтрагентов.ОснованиеДопСоглашения КАК Основание
	|ПОМЕСТИТЬ ПрикрепленныеФайлы
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентовПрисоединенныеФайлы КАК энргДоговорыКонтрагентовПрисоединенныеФайлы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО энргДоговорыКонтрагентовПрисоединенныеФайлы.ВладелецФайла = энргДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	энргДоговорыКонтрагентов.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСведенияОФайлахДополнительныеРеквизиты.ТипФайла КАК ТипФайла,
	|	ПрикрепленныеФайлы.ВидДоговора КАК ВидДоговора,
	|	ПрикрепленныеФайлы.КатегорияКонтрагента КАК КатегорияКонтрагента,
	|	ПрикрепленныеФайлы.Основание КАК Основание
	|ПОМЕСТИТЬ ТипыПрикрепленныхФайлов
	|ИЗ
	|	ПрикрепленныеФайлы КАК ПрикрепленныеФайлы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСведенияОФайлахДополнительныеРеквизиты КАК энргСведенияОФайлахДополнительныеРеквизиты
	|		ПО ПрикрепленныеФайлы.Ссылка = энргСведенияОФайлахДополнительныеРеквизиты.Файл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбязательныеДокументыДляЗаключенияДоговора.ТипФайла КАК ТипФайла
	|ИЗ
	|	РегистрСведений.бестОбязательныеДокументыДляЗаключенияДоговора КАК бестОбязательныеДокументыДляЗаключенияДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТипыПрикрепленныхФайлов КАК ТипыПрикрепленныхФайлов
	|		ПО бестОбязательныеДокументыДляЗаключенияДоговора.ТипФайла = ТипыПрикрепленныхФайлов.ТипФайла
	|			И бестОбязательныеДокументыДляЗаключенияДоговора.КатегорияКонтрагента = ТипыПрикрепленныхФайлов.КатегорияКонтрагента
	|			И бестОбязательныеДокументыДляЗаключенияДоговора.ВидДоговора = ТипыПрикрепленныхФайлов.ВидДоговора
	|ГДЕ
	|	ТипыПрикрепленныхФайлов.ТипФайла ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА бестОбязательныеДокументыДляЗаключенияДоговора.ДополнительноеСоглашение
	|				ТОГДА ТипыПрикрепленныхФайлов.Основание <> ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.Пустаяссылка)
	|			ИНАЧЕ ТипыПрикрепленныхФайлов.Основание = ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.Пустаяссылка)
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		СообщениеТекст = "Не хватает следующих документов: ";
		Пока Выборка.Следующий() Цикл
			СообщениеТекст = СообщениеТекст + Выборка.ТипФайла + "; ";
		КонецЦикла;
		ОбщегоНазначения.СообщитьПользователю(СообщениеТекст);
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаполнитьВложения(Вложения, ОписаниеВложенияПисьма, ОтправляемыеФайлы)
	Для каждого Стр из ОтправляемыеФайлы Цикл
		Файл = Стр.Файл; 
		ПолноеНаименование  = Файл.ПутьКФайлу;
		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Файл.Том,"ПолныйПутьWindows") + ПолноеНаименование);
		ПараметрыВложения	= Новый Структура(ОписаниеВложенияПисьма, Файл.Наименование + "." + Файл.Расширение, ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла) ,ДвоичныеДанныеФайла);
		Вложения.Добавить(ПараметрыВложения);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЗаполнения(Задача)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестНастройкаЗаполненияПисем.Тема КАК Тема,
		|	бестНастройкаЗаполненияПисем.ТелоПисьма КАК Тело,
		|	энргКонтрагентыКонтактнаяИнформация.Представление КАК АдресКому
		|ИЗ
		|	Задача.бестЗадачаДоговорногоБлока КАК бестЗадачаДоговорногоБлока
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестНастройкаЗаполненияПисем КАК бестНастройкаЗаполненияПисем
		|		ПО бестЗадачаДоговорногоБлока.ТочкаМаршрута = бестНастройкаЗаполненияПисем.ТочкаМаршрута
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
		|			ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация.Ссылка
		|				И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента))
		|		ПО бестЗадачаДоговорногоБлока.Договор = энргДоговорыКонтрагентов.Ссылка,
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами КАК бестЗаключениеДоговоровСЮридическимиЛицами
		|ГДЕ
		|	бестЗадачаДоговорногоБлока.Ссылка = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	Возврат Запрос.Выполнить();
	
КонецФункции
#КонецОбласти
